app/controllers/songs_controller.rb

  def index
    if params[:artist_id]
      @artist = Artist.find_by(id: params[:artist_id])
      if @artist.nil?
        redirect_to artists_path, alert: "Artist not found."
      else
        @songs = @artist.songs
      end
    else
      @songs = Song.all
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 5]]

  def show
    if params[:artist_id]
      @artist = Artist.find_by(id: params[:artist_id])
      if @song.nil?
        redirect_to artist_songs_path(@artist), alert: "Song not found."
      else
        @song = @artist.songs.find_by(id: params[:artist_id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT ?  [["artist_id", 5], ["id", 5], ["LIMIT", 1]]